add runtime docs and use mermaid
